Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаСообщения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяТипаПараметраВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаSMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРедактированияЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслитерироватьИменаФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковатьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПоВнешнейОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормыИВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РассылкаПоШаблонамФормыКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ФормаРассылкиОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	ПриЗаписиШаблонаСообщений(Форма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

Процедура ФормаРассылкиПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	ШаблоныПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
КонецПроцедуры

Процедура ФормаРассылкиПередУдалением(Форма, Элемент, Отказ) Экспорт
	ШаблоныПередУдалением(Форма, Элемент, Отказ);
КонецПроцедуры

Процедура ФормаРассылкиПриАктивизацииСтроки(Форма, Элемент) Экспорт
	ШаблоныПриАктивизацииСтроки(Форма, Элемент);
КонецПроцедуры

Процедура ФормаРассылкиПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	ШаблоныПередНачаломИзменения(Форма, Элемент, Отказ);
КонецПроцедуры

Процедура ФормаРассылкиВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	ШаблоныВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
КонецПроцедуры

Процедура ФормаРассылкиПриУспешномЗавершенииОтправки(Форма, Результат, ДополнительныеПараметры) Экспорт
	СохранитьПользовательскиеНастройки(Форма);
КонецПроцедуры

Процедура ФормаРассылкиВыполнитьКоманду(Форма, Команда) Экспорт
	Если Команда.Имя = "ДобавитьШаблон" Тогда
		ДобавитьШаблон(Форма, Команда);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗаписиШаблонаСообщений(Форма, ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "Запись_ШаблоныСообщений" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РассылатьПоШаблону Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Подключаемый_РассылкаПоШаблонамВызовСервера(Параметр, "ОбновитьСписокШаблонов");
	
	Если Параметр = Форма.ВыбранныйШаблон Тогда
		ПриАктивизацииСтрокиШаблона(Форма);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыШаблоны

Процедура ШаблоныПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Копирование И Не Группа Тогда
		СоздатьНовыйШаблон(Форма, Элемент.ТекущиеДанные.Ссылка);
		Возврат;
	КонецЕсли;

	СоздатьНовыйШаблон(Форма);
	
КонецПроцедуры

Процедура ШаблоныПередУдалением(Форма, Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура ШаблоныПриАктивизацииСтроки(Форма, Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриАктивизацииСтрокиШаблона(Форма);
	
КонецПроцедуры

Процедура ШаблоныПередНачаломИзменения(Форма, Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьШаблон(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

Процедура ШаблоныВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьШаблон(Форма.Шаблоны.НайтиПоИдентификатору(ВыбраннаяСтрока).Ссылка);
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьНовыйШаблон(Форма, ЗначениеКопирования = Неопределено)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидСообщения"          , "Письмо");
	ПараметрыФормы.Вставить("ПолноеИмяТипаОснования", Форма.ПредметШаблона);
	ПараметрыФормы.Вставить("ТолькоДляАвтора",        Истина);
	ПараметрыФормы.Вставить("ВладелецШаблона",        Форма.ВладелецШаблона);
	ПараметрыФормы.Вставить("ЗначениеКопирования",    ЗначениеКопирования);
	ПараметрыФормы.Вставить("Новый",                  Истина);
	
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура ОткрытьШаблон(ШаблонПисьма)

	Если Не ЗначениеЗаполнено(ШаблонПисьма) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Ключ", ШаблонПисьма);
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

Процедура ПриАктивизацииСтрокиШаблона(Форма)

	Элементы = Форма.Элементы;

	Форма.ВыбранныйШаблон = Элементы.Шаблоны.ТекущиеДанные.Ссылка;

	Если Элементы.Шаблоны.ТекущиеДанные.ТипТекстаПисьма = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		Элементы.СтраницыПредпросмотра.ТекущаяСтраница = Элементы.СтраницаФорматированныйДокумент;
		ОбновитьДанныеПредпросмотра(Форма);
	Иначе
		Элементы.СтраницыПредпросмотра.ТекущаяСтраница = Элементы.СтраницаОбычныйТекст;
		Форма.ПредпросмотрОбычныйТекст.УстановитьТекст(Элементы.Шаблоны.ТекущиеДанные.ТекстШаблона);
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьДанныеПредпросмотра(Форма)
	
	ТекущиеДанные = Форма.Элементы.Шаблоны.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	Параметры.Вставить("ТекстШаблонаПисьмаHTML", ТекущиеДанные.ТекстШаблона);
	Параметры.Вставить("СсылкаНаТекущийОбъект", ТекущиеДанные.Ссылка);
	
	Форма.Подключаемый_РассылкаПоШаблонамВызовСервера(Параметры, "УстановитьHTMLВФорматированныйДокумент");
		
КонецПроцедуры

Процедура СохранитьПользовательскиеНастройки(Форма)
	
	Если Форма.РассылатьПоШаблону Тогда
		Форма.Подключаемый_РассылкаПоШаблонамВызовСервера(Неопределено, "СохранитьПользовательскиеНастройки");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьШаблон(Форма, Команда)
	СоздатьНовыйШаблон(Форма);
КонецПроцедуры

#КонецОбласти
